public/man/man1/bluetoothctl-player.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - bluetoothctl-player.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - bluetoothctl-player.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>bluetoothctl-player - Media Player Submenu</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>bluetoothctl</strong> [–options] [player.commands]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
MEDIA PLAYER COMMANDS
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
list
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>List available players.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># list</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
show
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Show player information.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># show [player]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
select
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Select default player.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># select &lt;player&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
play
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>Start playback.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># play [item]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
pause
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>Pause playback.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># pause</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
stop
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<p>Stop playback.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># stop</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
next
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>Jump to next item.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># next</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
previous
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>Jump to previous item.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># previous</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
fast-forward
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>Fast forward playback.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># fast-forward</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
rewind
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<p>Rewind playback.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># rewind</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
equalizer
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>Enable/Disable equalizer.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># equalizer &lt;on/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
repeat
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>Set repeat mode.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># repeat &lt;singletrack/alltrack/group/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
shuffle
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>Set shuffle mode.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># shuffle &lt;alltracks/group/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-17" class="outline-3">
<h3 id="headline-17">
scan
</h3>
<div id="outline-text-headline-17" class="outline-text-3">
<p>Set scan mode.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># scan &lt;alltracks/group/off&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
change-folder
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<p>Change current folder.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># change-folder &lt;item&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-19" class="outline-3">
<h3 id="headline-19">
list-items
</h3>
<div id="outline-text-headline-19" class="outline-text-3">
<p>List items of current folder.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># list-items [start] [end]</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
search
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<p>Search items containing string.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># search &lt;string&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
queue
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<p>Add item to playlist queue.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># queue &lt;item&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
<div id="outline-container-headline-22" class="outline-3">
<h3 id="headline-22">
show-item
</h3>
<div id="outline-text-headline-22" class="outline-text-3">
<p>Show item information.</p>
<blockquote>
<dl>
<dt>
<strong>Usage</strong>
</dt>
<dd><strong># show-item &lt;item&gt;</strong></dd>
</dl>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-23" class="outline-2">
<h2 id="headline-23">
RESOURCES
</h2>
<div id="outline-text-headline-23" class="outline-text-2">
<p>&lt;http://www.bluez.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-24" class="outline-2">
<h2 id="headline-24">
REPORTING BUGS
</h2>
<div id="outline-text-headline-24" class="outline-text-2">
<p>&lt;linux-bluetooth@vger.kernel.org&gt;</p>
</div>
</div>
<div id="outline-container-headline-25" class="outline-2">
<h2 id="headline-25">
COPYRIGHT
</h2>
<div id="outline-text-headline-25" class="outline-text-2">
<p>Free use of this software is granted under ther terms of the GNU Lesser
General Public Licenses (LGPL).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
